app/views/word/show.html.erb

SELECT `words`.* FROM `words` WHERE (word = '--- \n- word\n- tata\n') LIMIT 1
---

  <% wd = Words.find(:first, :conditions => ["id = ?", awd]) %>