app/controllers/word_controller.rb

SELECT `words`.* FROM `words` WHERE (word = '--- \n- word\n- tata\n') LIMIT 1
---
  def show
    @allword = Words.find(:all, :limit => 10, :order => "created_at desc")

INSERT INTO `words` (`assoword`, `created_at`, `def`, `updated_at`, `word`) VALUES ('4,5,6,7,8,', '2011-11-22 23:41:30', 'fdscdscs', '2011-11-22 23:41:30', 'grdgvf')
---
  def create
    @allword = Words.find(:all, :limit => 10, :order => "created_at desc")
   params[:words][:assoword] = params[:hidewd]
   @word = Words.new(params[:words])
   if @word.save

SELECT `words`.* FROM `words` WHERE (word = 'toto') LIMIT 1
---
  def edit
    @allword = Words.all

SELECT `words`.* FROM `words` WHERE (word = 'toto') LIMIT 1
UPDATE `words` SET `updated_at` = '2011-11-22 17:27:17', `def` = 'tytytytytytytyty' WHERE `words`.`id` = 4
---
  def update
   params[:words][:assoword] = params[:hidewd]
   @word = Words.find(:first, :conditions => ["word = ?", params[:words][:word].to_s ])
   @word.update_attributes(params[:words])

SELECT `words`.* FROM `words` WHERE (word = 'rez') LIMIT 1
DELETE FROM `words` WHERE `words`.`id` = 14
---
  def delete
    @word = Words.find(:first, :conditions => ["word = ?", params[:id].to_s ])
    @word.destroy